# Tranformações Estruturais no DF

In [3]:
# Dados de Exemplo
import pandas as pd
dados = pd.read_csv('Datasets/aluguel_residencial.csv', sep = ';').fillna(0)
bairros = ['Barra da Tijuca', 'Copacabana', 'Ipanema', 'Leblon', 'Botafogo', 'Flamengo', 'Tijuca']
selecao = dados['Bairro'].isin(bairros)
dados = dados[selecao]
dados.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
6,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,0.0,0.0
11,Apartamento,Copacabana,1,0,1,40,2000.0,561.0,50.0
12,Quitinete,Copacabana,1,0,0,27,1800.0,501.0,0.0
13,Apartamento,Copacabana,4,3,1,243,13000.0,2000.0,803.0

## `.Groupby()` 
__A função .groupby([lista de var agrupadas]) cria um DF, que é um dicionário com `{var_agrupada1:[Lista de indices do Grupo],var_agrupada2:[Lista de indices do Grupo]}`__

In [6]:
# Agrupando Bairros em data frame agrupado
grupo_bairro = dados.groupby('Bairro')
type(grupo_bairro)

pandas.core.groupby.generic.DataFrameGroupBy

In [7]:
grupo_bairro.groups

{'Barra da Tijuca': Int64Index([    6,    16,    18,    23,    32,    34,    37,    44,    45,
                58,
             ...
             22523, 22525, 22528, 22536, 22554, 22555, 22565, 22566, 22567,
             22574],
            dtype='int64', length=3922),
 'Botafogo': Int64Index([   25,    50,    91,    92,   115,   124,   132,   140,   206,
               210,
             ...
             22217, 22233, 22246, 22277, 22406, 22413, 22419, 22468, 22500,
             22544],
            dtype='int64', length=890),
 'Copacabana': Int64Index([    0,    11,    12,    13,    26,    27,    30,    33,    90,
                95,
             ...
             22460, 22466, 22490, 22497, 22534, 22537, 22549, 22563, 22564,
             22569],
            dtype='int64', length=2760),
 'Flamengo': Int64Index([   81,   144,   228,   295,   332,   358,   367,   372,   380,
               404,
             ...
             22308, 22331, 22381, 22403, 22433, 22457, 22482, 22485, 22494,
             22548],
            dtype='int64', length=723),
 'Ipanema': Int64Index([   21,    41,    42,    47,    54,    55,    76,    88,    96,
               119,
             ...
             22471, 22476, 22484, 22493, 22498, 22499, 22508, 22542, 22550,
             22571],
            dtype='int64', length=1800),
 'Leblon': Int64Index([   29,    62,    94,   101,   120,   139,   167,   173,   177,
               193,
             ...
             22475, 22515, 22524, 22531, 22539, 22540, 22541, 22562, 22570,
             22579],
            dtype='int64', length=1277),
 'Tijuca': Int64Index([   17,    20,    22,    84,    86,   131,   151,   155,   164,
               170,
             ...
             22322, 22326, 22358, 22361, 22414, 22428, 22467, 22483, 22527,
             22572],
            dtype='int64', length=1113)}

In [8]:
grupo_bairro[['Valor', 'Condominio']].mean().round(2)

                   Valor  Condominio
Bairro
Barra da Tijuca  7071.92     3537.24
Botafogo         8681.20      958.77
Copacabana       4135.91     1100.71
Flamengo         4148.49     1088.43
Ipanema          9375.91     2199.55
Leblon           8757.75     2075.83
Tijuca           2042.19      703.38

In [15]:
# Agrupando duas ou mais variáveis
grupo_bairro = dados.groupby(['Bairro','Tipo'])

In [18]:
# Retorna um Data Frame
grupo_bairro[['Valor', 'Condominio']].mean().round(2).head(7)

                                       Valor  Condominio
Bairro          Tipo
Barra da Tijuca Apartamento          5585.18     3901.29
                Casa                14592.07     1128.06
                Casa de Condomínio  15850.27     1499.01
                Quitinete            1550.00      850.00
Botafogo        Apartamento          9357.32     1041.48
                Casa                12992.31        0.00
                Casa de Condomínio  11475.00      137.50

#### Fazendo Operações Groupby direto

In [13]:
# Uma variável Retornando uma Série
medias_por_bairro = dados.groupby(['Bairro']).Valor.mean()
medias_por_bairro.head()

Bairro
Barra da Tijuca    7071.918154
Botafogo           8681.197753
Copacabana         4135.914493
Flamengo           4148.489627
Ipanema            9375.905000
Name: Valor, dtype: float64

In [14]:
# Duas variáveis agrupadas Retornando uma Série
medias_por_bairro_e_tipo =  dados.groupby(['Bairro','Tipo']).Valor.mean()
medias_por_bairro_e_tipo.head()

Bairro           Tipo
Barra da Tijuca  Apartamento            5585.180784
                 Casa                  14592.072289
                 Casa de Condomínio    15850.266129
                 Quitinete              1550.000000
Botafogo         Apartamento            9357.317259
Name: Valor, dtype: float64

In [12]:
type(medias_por_bairro_e_tipo)

pandas.core.series.Series

## `Union Vertical e Horizontal` com `pd.concat()`

In [40]:
# dados de Teste
data1 = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]
data2 = [['A','A','A'],
        ['A','A','A'],
        ['A','A','A']]
data3 = [['B','B','B'],
        ['B','B','B'],
        ['B','B','B']]
df1 = pd.DataFrame(data = data1)
df2 = pd.DataFrame(data = data2)
df3 = pd.DataFrame(data = data3)

In [41]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [42]:
df2

   0  1  2
0  A  A  A
1  A  A  A
2  A  A  A

In [43]:
df3

   0  1  2
0  B  B  B
1  B  B  B
2  B  B  B

In [45]:
# Passamos uma lista de iteráveis 
# axis = 0  une Linhas (Union Vertical)
# axias 0 é default
pd.concat([df1,df2,df3], axis =0)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9
0  A  A  A
1  A  A  A
2  A  A  A
0  B  B  B
1  B  B  B
2  B  B  B

In [46]:
# Passamos uma lista de iteráveis 
# axis = 1  une colunas (Union horizontal)
pd.concat([df1,df2,df3], axis =1)

   0  1  2  0  1  2  0  1  2
0  1  2  3  A  A  A  B  B  B
1  4  5  6  A  A  A  B  B  B
2  7  8  9  A  A  A  B  B  B

In [ ]:
#